app/controllers/image/register_controller.rb

SELECT  "tmp_images".* FROM "tmp_images" ORDER BY "tmp_images"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "images"
---
  def index
    tmp = TmpImage.first
    @image = tmp[:filename]
    @blocks = TextBlock.view_css(tmp[:image_id])
    @count = Image.count

INSERT INTO "text_blocks" ("image_id", "text", "x1", "x2", "y1", "y2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["image_id", 28], ["text", "キカガク"], ["x1", 32], ["x2", 145], ["y1", 21], ["y2", 48], ["created_at", 2016-12-30 03:29:26 UTC], ["updated_at", 2016-12-30 03:29:26 UTC]]
SELECT  "tmp_images".* FROM "tmp_images" ORDER BY "tmp_images"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def register
    pos = params[:pos]
    text = TextBlock.create(
      image_id: TmpImage.first[:image_id],
      text: pos[:text],
      x1: pos[:pos1_x1],  y1: pos[:pos1_y1],
      x2: pos[:pos2_x2],  y2: pos[:pos2_y2]
    )

DELETE FROM "text_blocks" WHERE "text_blocks"."id" = ?  [["id", 9]]
SELECT  "text_blocks".* FROM "text_blocks" ORDER BY "text_blocks"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def delete
    TextBlock.last.delete

SELECT  "tmp_images".* FROM "tmp_images" ORDER BY "tmp_images"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "images".* FROM "images" WHERE "images"."filename" = ? LIMIT ?  [["filename", "image_sample_01.png"], ["LIMIT", 1]]
UPDATE "tmp_images" SET "filename" = ?, "image_id" = ?, "updated_at" = ? WHERE "tmp_images"."id" = ?  [["filename", "image_sample_02.png"], ["image_id", 30], ["updated_at", 2016-12-30 03:29:45 UTC], ["id", 7]]
SELECT COUNT(*) FROM "images" WHERE "images"."filename" = ?  [["filename", "image_sample_01.png"]]
INSERT INTO "images" ("filename", "created_at", "updated_at") VALUES (?, ?, ?)  [["filename", "image_sample_02.png"], ["created_at", 2016-12-30 03:29:45 UTC], ["updated_at", 2016-12-30 03:29:45 UTC]]
---
  def next
    # 現状の画像を完了に
    tmp = TmpImage.first
    image = Image.find_by(filename: tmp[:filename])
    image.update(is_complete: true)
    # 新しい画像に切り替える
    files = Dir::entries("app/assets/images/")
    files.each do |file|
      next unless %w(.jpg .png .jpeg).include?(File.extname(file))
      # ファイル名が既に書き込まれていないか確認
      db_files = Image.where(filename: file)
      if db_files.empty?
        image = Image.create(filename: file)

DELETE FROM "tmp_images"
DELETE FROM "text_blocks"
INSERT INTO "tmp_images" ("filename", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["filename", "image_sample_01.png"], ["image_id", 28], ["created_at", 2016-12-30 03:29:17 UTC], ["updated_at", 2016-12-30 03:29:17 UTC]]
---
  def reset
    # データベースの中身を削除する
    Image.delete_all
    TmpImage.delete_all
    TextBlock.delete_all
    # 最初の画像を指定する ※ サンプル画像以外の場合はこちらを書き換え
    image = Image.create(filename:"suumo00751.jpg")